"CIAdditionCompositing" = "추가";
"CIAffineClamp" = "어파인 클램프";
"CIAffineTile" = "어파인 타일";
"CIAffineTransform" = "어파인 변형";
"CIBarsSwipeTransition"="막대 강타 변환";
"CIBlendWithMask" = "마스크와 혼합";
"CIBloom" = "블룸";
"CIBoxBlur"="상자 흐림 효과";
"CIBumpDistortion" = "범프 왜곡";
"CIBumpDistortionLinear"="범프 왜곡 선형";
"CICMYKHalftone" = "CMYK 하프톤";
"CICheckerboardGenerator" = "체커보드";
"CICircleSplashDistortion" = "원형 물결 왜곡";
"CICircularScreen" = "원형 화면";
"CICircularWrap" = "원형 랩 왜곡";
"CIColorControls" = "색상 제어";
"CIColorCube" = "색상 큐브";
"CIColorInvert" = "색상 반전";
"CIColorMap" = "색상 맵";
"CIColorMatrix" = "색상 매트릭스";
"CIColorMonochrome" = "색상 단색화";
"CIColorPosterize" = "색상 포스터화";
"CIComicEffect" = "만화책 효과";
"CIConstantColorGenerator" = "불변 색상";
"CICopyMachineTransition" = "복사기";
"CICrop" = "잘라내기";
"CICrystallize" = "투명화";
"CIDiscBlur"="디스크 흐림 효과";
"CIDisintegrateWithMaskTransition" = "마스크와 분리";
"CIDisplacementDistortion" = "변위 왜곡";
"CIDissolveTransition" = "디졸브";
"CIDotScreen" = "도트 화면";
"CIEdges" = "가장자리";
"CIEdgeWork" = "가장자리 작업";
"CIEightfoldReflectedTile"="8방향으로 반사된 타일";
"CIExposureAdjust" = "노출 조절";
"CIFalseColor" = "가색상";
"CIFastBoxBlur" = "빠른 상자 흐림 효과";
"CIFastDiscBlur" = "빠른 디스크 흐림 효과";
"CIFlashTransition" = "플래시";
"CIFourfoldReflectedTile"="4방향으로 반사된 타일";
"CIFourfoldRotatedTile"="4방향으로 회전된 타일";
"CIFourfoldTranslatedTile"="4방향으로 변환된 타일";
"CIGammaAdjust" = "감마 조절";
"CIGaussianBlur" = "가우시안 흐림 효과";
"CIGaussianGradient" = "가우시안 그라디언트";
"CIGlassDistortion" = "유리 왜곡";
"CIGlassLozenge" = "유리 마름모꼴";
"CIGlideReflectedTile"="글라이드 반사된 타일";
"CIGloom" = "음침";
"CIHatchedScreen" = "그늘진 화면";
"CIHeightFieldFromMask" = "마스크에서 높이 필드";
"CIHexagonalPixellate"="6각 픽셀화";
"CIHoleDistortion" = "구멍 왜곡";
"CIHueAdjust" = "색조 조절";
"CIKaleidoscope" = "만화경";
"CILanczosScaleTransform" = "Lanczos 크기 변형";
"CILenticularHaloGenerator" = "볼록 렌즈의 주변광";
"CILineOverlay" = "라인 오버레이";
"CILineScreen" = "라인 화면";
"CILinearGradient" = "선형 그라디언트";
"CIMaskToAlpha" = "알파로 마스크";
"CIMaximumCompositing" = "최대";
"CIMedianFilter" = "중간";
"CIMinimumCompositing" = "최소";
"CIModTransition" = "모드";
"CIMotionBlur" = "배경영상 흐림 효과";
"CIMultiplyCompositing" = "증대";
"CINoiseReduction" = "소음 감소";
"CIOpTile" = "Op 타일";
"CIPageCurlTransition" = "용지 말림";
"CIParallelogramTile" = "평행사변형 타일";
"CIPerspectiveTile" = "투시도 타일";
"CIPerspectiveTransform" = "투시도 변형";
"CIPinchDistortion" = "핀치 왜곡";
"CIPixellate" = "픽셀화";
"CIPointillize" = "점묘화";
"CIRadialGradient" = "방사형 그라디언트";
"CIRandomGenerator" = "무작위 생성자";
"CIRippleTransition" = "물결";
"CISepiaTone" = "세피아 색조";
"CIShadedMaterial" = "그늘진 물체";
"CISharpenLuminance" = "강화된 휘도";
"CISixfoldReflectedTile"="6방향으로 반사된 타일";
"CISixfoldRotatedTile"="6방향으로 회전된 타일";
"CISourceAtopCompositing" = "원본 꼭대기";
"CISourceInCompositing" = "원본 안";
"CISourceOutCompositing" = "원본 밖";
"CISourceOverCompositing" = "원본 마지막";
"CISpotColor" = "영역 색상";
"CISpotLight" = "영역광";
"CIStarShineGenerator" = "스타 샤인";
"CIStripesGenerator" = "스트라이프";
"CISunbeamsGenerator" = "태양광";
"CISwipeTransition" = "강타";
"CITorusLensDistortion" = "토러스 렌즈 왜곡";
"CITriangleTile" = "삼각형 타일";
"CITwelvefoldReflectedTile"="12방향으로 반사된 타일";
"CITwirlDistortion" = "나선형 왜곡";
"CIUnsharpMask" = "흐린 마스크";
"CIVortexDistortion" = "소용돌이 왜곡";
"CIWhitePointAdjust" = "하얀 점 조절";
"CIZoomBlur" = "줌 흐림 효과";
"CIColorBlendMode" = "색상 혼합 모드";
"CIColorBurnBlendMode" = "색상 번 혼합 모드";
"CIColorDodgeBlendMode" = "색상 닷지 혼합 모드";
"CIDarkenBlendMode" = "어두운 혼합 모드";
"CIDifferenceBlendMode" = "차이 혼합 모드";
"CIExclusionBlendMode" = "배제 혼합 모드";
"CIHardLightBlendMode" = "강한 빛 혼합 모드";
"CIHueBlendMode" = "색조 혼합 모드";
"CILightenBlendMode" = "밝은 혼합 모드";
"CILuminosityBlendMode" = "발광 혼합 모드";
"CIMultiplyBlendMode" = "증대 혼합 모드";
"CIOverlayBlendMode" = "덧칠 혼합 모드";
"CISaturationBlendMode" = "채도 혼합 모드";
"CIScreenBlendMode" = "화면 혼합 모드";
"CISoftLightBlendMode" = "약한  빛 혼합 모드";
"CIAreaHistogram" = "영역 막대 그래프";
"CIAreaMaximum" = "영역 최대";
"CIAreaMinimum" = "영역 최소";
"CIAreaMaximumAlpha" = "영역 최대 알파";
"CIAreaMinimumAlpha" = "영역 최소 알파";
"CIAreaAverage" = "영역 평균";
"CIRowAverage" = "행 평균";
"CIColumnAverage" = "열 평균";
"CIMinimumComponent" = "최소 구성요소";
"CIMaximumComponent" = "최대 구성요소";
